Revit 2027 API
ParameterTypeId.ElemCategoryParam Property
 "Category"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElemCategoryParam { get; }
Public Shared ReadOnly Property ElemCategoryParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElemCategoryParam {
	ForgeTypeId^ get ();
}
static member ElemCategoryParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace